Revit 2027 API
IFCData.SetTypeList Method
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetTypeList(
	IList<string> typeList
)
Public Sub SetTypeList (
	typeList As IList(Of String)
)
public:
void SetTypeList(
	IList<String^>^ typeList
)
member SetTypeList :
        typeList : IList<string> -> unit
Parameters
typeList IList<String>
See Also
Reference
IFCData Class
Autodesk.Revit.DB.IFC Namespace